remote-jobs-api/app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(id: authenticate_user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]