remote-jobs-api/app/controllers/jobs_controller.rb

    def create
        job = Job.new(job_params)
        if !job.save
            job = Job.find_by(url: params[:job][:url])
        end
        user = User.find(params[:job][:user_id])
        user_job = UsersJob.new(user_id: user.id, job_id: job.id)
        render json: user_job.save ? job : {errors: 'Job has been already saved'}
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "users_jobs" ("user_id", "job_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["job_id", 2], ["created_at", "2020-09-01 01:22:57.049872"], ["updated_at", "2020-09-01 01:22:57.049872"]]