remote-jobs-api/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "um_2003_8@hotmail.com"], ["LIMIT", 1]]
---
    def login
        @user = User.find_by(email: params[:user][:email])