remote-jobs-api/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        render json: user.save ? user : {error: 'something went wrong'}
---
INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "ian@hotmail.com"], ["password", "password"], ["created_at", "2020-08-22 20:18:14.093334"], ["updated_at", "2020-08-22 20:18:14.093334"]]